       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           DISPLAY "Hello, legacy world!".
           STOP RUN.
